app/controllers/api/v1/attendances_controller.rb

    def create
      @attendance = Attendance.new(attendance_params)

      if @attendance.save
---
INSERT INTO "attendances" ("practice_id", "skater_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["practice_id", 1], ["skater_id", 2], ["created_at", "2020-01-05 22:25:51.809736"], ["updated_at", "2020-01-05 22:25:51.809736"]]