app/controllers/api/v1/practices_controller.rb

    def create
      @practice = Practice.new(practice_params)

      if @practice.save
---
INSERT INTO "practices" ("date", "location", "has_happened", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "01/20/2020"], ["location", "rhode house"], ["has_happened", "f"], ["team_id", 1], ["created_at", "2020-01-05 20:03:30.977843"], ["updated_at", "2020-01-05 20:03:30.977843"]]

    def list
      @pratices = Practice.where(team_id: params[:team_id])
---
SELECT "practices".* FROM "practices" WHERE "practices"."team_id" = $1  [["team_id", 1]]