app/controllers/api/v1/skaters_controller.rb

SELECT "skaters".* FROM "skaters"
---
    def index
      @skaters = Skater.all

INSERT INTO "skaters" ("name", "veteran", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "hot new skater number four"], ["veteran", "t"], ["team_id", 1], ["created_at", "2020-01-04 21:40:47.698186"], ["updated_at", "2020-01-04 21:40:47.698186"]]
INSERT INTO "skills" ("lateral_movement", "hockey_stop", "plow_stop", "turning_toe", "power_slide", "transitions", "backwards_skating", "speed_endurance", "recovery", "pack_work", "strategy_adaptability", "awareness_communication", "mental_recovery", "skater_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
    def create
      @skater = Skater.new(skater_params)
      if @skater.save

        if @skater.veteran
          Skill.create(veteran_params)

SELECT  "skaters".* FROM "skaters" WHERE "skaters"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "skills".* FROM "skills" WHERE "skills"."skater_id" = $1 LIMIT $2  [["skater_id", 1], ["LIMIT", 1]]
DELETE FROM "skaters" WHERE "skaters"."id" = $1  [["id", 4]]
DELETE FROM "skills" WHERE "skills"."id" = $1  [["id", 1]]
---
    def destroy
      @deletedSkater = Skater.find(params[:id])
      @skaterSkill = Skill.find_by(skater_id: params[:id])

      @skaterSkill.destroy

SELECT  "skaters".* FROM "skaters" WHERE "skaters"."team_id" = $1 AND "skaters"."accepted" = $2 LIMIT $3  [["team_id", 1], ["accepted", "f"], ["LIMIT", 1]]
---
    def assessment_list
      @skaters = Team.find(params[:team_id]).skaters.where(accepted: false)

SELECT  "skaters".* FROM "skaters" WHERE "skaters"."team_id" = $1 AND "skaters"."accepted" = $2 LIMIT $3  [["team_id", 1], ["accepted", "t"], ["LIMIT", 1]]
---
    def roster_list
      @skaters = Team.find(params[:team_id]).skaters.where(accepted: true)

SELECT  "skaters".* FROM "skaters" WHERE "skaters"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "skills".* FROM "skills" WHERE "skills"."skater_id" = $1 LIMIT $2  [["skater_id", 7], ["LIMIT", 1]]
SELECT "practices".* FROM "practices" INNER JOIN "attendances" ON "practices"."id" = "attendances"."practice_id" WHERE "attendances"."skater_id" = $1  [["skater_id", 7]]
---
      def set_skater
        @skater = Skater.includes(:skill, :practices).find(params[:id])