app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."team_id" = $1 AND "users"."username" = $2 LIMIT $3  [["team_id", 1], ["username", "test"], ["LIMIT", 1]]
---
  def create
    @user = Team.find(user_params[:team_id]).users.find_by(username: user_params[:username])